sample_app/app/controllers/account_activations_controller.rb

    def edit
        user = User.find_by(email: params[:email])
        if user && !user.activated && user.authenticated?(:activation, params[:id])
            user.update_attribute(:activated, true)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "test1@test1.com"], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = ?, "activated_at" = ? WHERE "users"."id" = ?  [["updated_at", "2024-06-13 10:10:41.326388"], ["activated_at", "2024-06-13 10:10:41.325968"], ["id", 103]]