sample_app/app/controllers/microposts_controller.rb

INSERT INTO "microposts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "This should be newest post"], ["user_id", 1], ["created_at", "2024-07-05 00:17:18.362741"], ["updated_at", "2024-07-05 00:17:18.362741"]]
SELECT  "microposts".* FROM "microposts" WHERE (user_id = 1) ORDER BY "microposts"."created_at" DESC LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = ?  [["user_id", 1]]
---
  def create
    @micropost = current_user.microposts.build(micropost_params)
    if @micropost.save
      flash[:success] = "Micropost created!"
      redirect_to root_url
    else
      # flash[:danger] = "Unable to create micropost"
      @feed = current_user.feed.paginate(page: params[:page], per_page: 10)