sample_app/app/controllers/static_pages_controller.rb

  def home
    if logged_in?
      @micropost = current_user.microposts.build
      @feed = current_user.feed.paginate(page: params[:page], per_page: 10)
---
SELECT  "microposts".* FROM "microposts" WHERE (user_id = 1) ORDER BY "microposts"."created_at" DESC LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = ?  [["user_id", 1]]