sample_app/app/controllers/users_controller.rb

  def index
    filtered_users = current_user.admin? ? User.all : User.where(activated: true)
    @users = filtered_users.paginate(page: params[:page])
---
SELECT  "users".* FROM "users" WHERE "users"."activated" = ? LIMIT ? OFFSET ?  [["activated", "t"], ["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "users" WHERE "users"."activated" = ?  [["activated", "t"]]

  def show
    @user = User.find(params[:id])
    @microposts = @user.microposts.paginate(page: params[:page], per_page: 10)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = ?  [["user_id", 115]]

  def update
    @user = User.find(params[:id])
    if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "email" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "foo"], ["email", "foo@bar.com"], ["password_digest", "$2a$04$mxLTrvfxKbE/0/bNjwktqeAewwvvb9wI749fZXrM2PylyR0wQfbHG"], ["updated_at", "2024-06-08 10:08:07.194170"], ["id", 858634300]]