sample_app/app/views/users/show.html.erb

SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = ?  [["user_id", 115]]
---
  <div class="col-md-8">
    <h3>Microposts (<%= @user.microposts.count%>)</h3>